Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/unemployed_people/signing_off.html.txt.tmx
Source language: en
Languages: ga

source: Signing off when you start work
ga: Ag síniú de nuair a thosnaíonn tú ag obair

source: You may get Jobseeker's Allowance, Jobseeker's Benefit or credits if you are registered as a jobseeker
ga: D’fhéadfá Liúntas do Lucht Cuardaigh Fostaíochta, Sochar do Lucht Cuardaigh Fostaíochta, nó Creidmheasanna a fháil má tá tú cláraithe mar dhífhostaithe

source: If you are registered as a jobseeker (in other words, signing-on with the Department of Social Protection), you should inform your local Intreo Centre or Social Welfare Branch Office of the date when you are going to start work
ga: Má tá tú cláraithe mar dhífhostaithe (i bhfocail eile, ag síniú leis an Roinn Coimirce Sóisialaí), ba chóir duit d’oifig leasa shóisialaigh áitiúil a chur ar an eolas maidir leis an dáta a mbeidh tú ag tosú ag obair

source: In some areas you can do this online
ga: I gceantair áirithe is féidir leat é seo a dhéanamh ar líne

source: Notifying your Intreo Centre or local Social Welfare Branch Office about when you are going to start work will ensure that you can get any payment due to you up to the date you start work
ga: Trí d’oifig leasa shóisialaigh áitiúil a chur ar an eolas maidir leis an am a mbeidh tú ag tosú ag obair, cinnteoidh tú go bhfaighidh tú aon íocaíocht atá dlite duit go dtí an dáta a dtosóidh tú ag obair

source: You can also get advice about possibly keeping some of your existing benefits and supports when you return to work
ga: Is féidir leat comhairle a fháil freisin faoin bhféidearthacht de chuid de do shochair agus do thacaí reatha a choinneáil nuair a fhilleann tú ar an obair

source: When you start work you may be entitled to additional benefits, for example, Family Income Supplement (FIS)
ga: Nuair a thosaíonn tú ag obair d’fhéadfá a bheith i dteideal sochar breise, mar shampla, Forlíonadh Ioncaim Teaghlaigh (FIT)
